coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/source/tmpm369_udmac.c
    /* write '1' to right bit position to requests a transfer */
    DMACx->CHNLSWREQUEST = (uint32_t)(0x01U << (uint32_t)Channel);

}


/**
  * @brief  Set transfer type to the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *          This parameter can be one of the following values:
  *            DMAC_UNIT_A :  DMAC unit A
  *            DMAC_UNIT_B :  DMAC unit B
  * @param  Channel: Select channel.
  *          This parameter can be one of the following values:
  *           when Type == DMAC_BURST:
  *             DMAC_ADC0_END,
  *             DMAC_ADC1_END,
  *             DMAC_SSP0_RX,
  *             DMAC_SSP0_TX,
  *             DMAC_SSP1_RX,
  *             DMAC_SSP1_TX,
  *             DMAC_SSP2_RX,
  *             DMAC_SSP2_TX,
  *             DMAC_FUART4_RX,
  *             DMAC_FUART4_TX,
  *             DMAC_FUART5_RX,
  *             DMAC_FUART5_TX,
  *             DMAC_SIO0_RX,
  *             DMAC_SIO0_TX,
  *             DMAC_SIO1_RX,
  *             DMAC_SIO1_TX,
  *             DMAC_SIO2_RX,
  *             DMAC_SIO2_TX,
  *             DMAC_SIO3_RX,
  *             DMAC_SIO3_TX,
  *             DMAC_SBI0_RXTX,
  *             DMAC_SBI1_RXTX,
  *             DMAC_SBI2_RXTX,
  *             DMAC_TMRB0_CMP_MATCH,
  *             DMAC_TMRB1_CMP_MATCH,
  *             DMAC_TMRB2_CMP_MATCH,
  *             DMAC_TMRB3_CMP_MATCH,
  *             DMAC_TMRB4_CMP_MATCH,
  *             DMAC_PIN,
  *             DMAC_SW_TRG
  *
  *           when Type == DMAC_SINGLE:
  *             DMAC_DAC0_TRG,
  *             DMAC_DAC1_TRG,
  *             DMAC_SSP0_RX,
  *             DMAC_SSP0_TX,
  *             DMAC_SSP1_RX,
  *             DMAC_SSP1_TX,
  *             DMAC_SSP2_RX,
  *             DMAC_SSP2_TX,
  *             DMAC_FUART4_RX,
  *             DMAC_FUART4_TX,
  *             DMAC_FUART5_RX,
  *             DMAC_FUART5_TX
  *
  * @param  Type: Select transfer type
  *          This parameter can be one of the following values:
  *             DMAC_BURST:  Single transfer is disabled, only burst transfer request can be used.
  *             DMAC_SINGLE: Single transfer is enabled.
  * @retval None.
  */
void DMAC_SetTransferType(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, DMAC_TransferType Type)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_TRANSFERTYPE(Type));

    if (Type == DMAC_BURST) {
        assert_param(IS_DMAC_CHANNEL_BURST(Channel));
        /* Write '1' to _SET to disables the single transfer to the channel, and only burst transfer request is valid */
        tmp = DMACx->CHNLUSEBURSTSET;
        tmp |= (uint32_t)(0x01U << (uint32_t)Channel);
        DMACx->CHNLUSEBURSTSET = tmp;
    } else {
        assert_param(IS_DMAC_CHANNEL_SINGLE(Channel));
        /* Write "1" to _CLR to enables the single transfer to the corresponding channel */
        /* this SFR is write only */
        DMACx->CHNLUSEBURSTCLR = (uint32_t)(0x01U << (uint32_t)Channel);
    }
}

/**
  * @brief  Get transfer type setting for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *          This parameter can be one of the following values:
  *            DMAC_UNIT_A :  DMAC unit A
  *            DMAC_UNIT_B :  DMAC unit B
  * @param  Channel: Select channel.
  *          This parameter can be one of the following values:
  *             DMAC_ADC0_END,
  *             DMAC_ADC1_END,
  *             DMAC_DAC0_TRG,
  *             DMAC_DAC1_TRG,
  *             DMAC_SSP0_RX,
  *             DMAC_SSP0_TX,
  *             DMAC_SSP1_RX,
  *             DMAC_SSP1_TX,
  *             DMAC_SSP2_RX,
  *             DMAC_SSP2_TX,
  *             DMAC_FUART4_RX,
  *             DMAC_FUART4_TX,
  *             DMAC_FUART5_RX,
  *             DMAC_FUART5_TX,
  *             DMAC_SIO0_RX,
  *             DMAC_SIO0_TX,
  *             DMAC_SIO1_RX,
  *             DMAC_SIO1_TX,
  *             DMAC_SIO2_RX,
  *             DMAC_SIO2_TX,
  *             DMAC_SIO3_RX,
  *             DMAC_SIO3_TX,
  *             DMAC_SBI0_RXTX,
  *             DMAC_SBI1_RXTX,
  *             DMAC_SBI2_RXTX,
  *             DMAC_TMRB0_CMP_MATCH,
  *             DMAC_TMRB1_CMP_MATCH,
  *             DMAC_TMRB2_CMP_MATCH,
  *             DMAC_TMRB3_CMP_MATCH,
  *             DMAC_TMRB4_CMP_MATCH,
  *             DMAC_PIN,
  *             DMAC_SW_TRG
  * @retval The transfer type.
  *             DMAC_BURST:  Only burst transfer request can be used.
  *             DMAC_SINGLE: Single transfer is enabled.
  */
DMAC_TransferType DMAC_GetTransferType(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel)
{
    uint32_t tmp = 0U;
    DMAC_TransferType Type = DMAC_SINGLE;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    tmp = DMACx->CHNLUSEBURSTSET & (uint32_t)(0x01U << (uint32_t)Channel);
    if (tmp) {
        /* read _SET, if bit is not 0, Only burst transfer request can be used */
        Type = DMAC_BURST;
    } else {
        Type = DMAC_SINGLE;
    }

    return Type;
}


/**
  * @brief  Set mask for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *          This parameter can be one of the following values:
  *            DMAC_UNIT_A :  DMAC unit A
  *            DMAC_UNIT_B :  DMAC unit B
  * @param  Channel: Select channel.
  *          This parameter can be one of the following values:
  *             DMAC_ADC0_END,
  *             DMAC_ADC1_END,
  *             DMAC_DAC0_TRG,
  *             DMAC_DAC1_TRG,
  *             DMAC_SSP0_RX,
  *             DMAC_SSP0_TX,
  *             DMAC_SSP1_RX,
  *             DMAC_SSP1_TX,
  *             DMAC_SSP2_RX,
  *             DMAC_SSP2_TX,
  *             DMAC_FUART4_RX,
  *             DMAC_FUART4_TX,
  *             DMAC_FUART5_RX,
  *             DMAC_FUART5_TX,
  *             DMAC_SIO0_RX,
  *             DMAC_SIO0_TX,
  *             DMAC_SIO1_RX,
  *             DMAC_SIO1_TX,
  *             DMAC_SIO2_RX,
  *             DMAC_SIO2_TX,
  *             DMAC_SIO3_RX,
  *             DMAC_SIO3_TX,
  *             DMAC_SBI0_RXTX,
  *             DMAC_SBI1_RXTX,
  *             DMAC_SBI2_RXTX,
  *             DMAC_TMRB0_CMP_MATCH,
  *             DMAC_TMRB1_CMP_MATCH,
  *             DMAC_TMRB2_CMP_MATCH,
  *             DMAC_TMRB3_CMP_MATCH,
  *             DMAC_TMRB4_CMP_MATCH,
  *             DMAC_PIN,
  *             DMAC_SW_TRG
  * @param  NewState: Clear or set the mask to enable or disable the DMA channel
  *          This parameter can be one of the following values:
  *             ENABLE : The DMA channel mask is cleared, DMA request is enable(valid)
  *             DISABLE :  The DMA channel is masked, DMA request is disable(invalid)
  * @retval None
  */
void DMAC_SetMask(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, FunctionalState NewState)
{
    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* ENABLE: clear mask to enable DMA channel,(valid). write '1' to _CLR */
        DMACx->CHNLREQMASKCLR = (uint32_t)(0x01U << (uint32_t)Channel);
    } else {
        /* DISABLE: set mask to disable DMA channel, (invalid), write '1' to _SET */
        DMACx->CHNLREQMASKSET = (uint32_t)(0x01U << (uint32_t)Channel);
    }

