coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/source/tmpm369_udmac.c
    return Priority;
}


/**
  * @brief  Clear the bus error of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *          This parameter can be one of the following values:
  *            DMAC_UNIT_A :  DMAC unit A
  *            DMAC_UNIT_B :  DMAC unit B
  * @retval None
  */
void DMAC_ClearBusErr(TSB_DMA_TypeDef * DMACx)
{
    assert_param(IS_DMAC_UNIT(DMACx));

    /* write '1' to bit0 */
    DMACx->ERRCLR = (uint32_t) 0x01U;
}

/**
  * @brief  Get the bus error state of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *          This parameter can be one of the following values:
  *            DMAC_UNIT_A :  DMAC unit A
  *            DMAC_UNIT_B :  DMAC unit B
  * @retval The bus error state
  *            SUCCESS :  No bus error
  *            ERROR   :  There is error in bus
  */
Result DMAC_GetBusErrState(TSB_DMA_TypeDef * DMACx)
{
    Result tmp = SUCCESS;

    assert_param(IS_DMAC_UNIT(DMACx));
    /* read bit0, '0' is no error, '1' is error */
    if (DMACx->ERRCLR & (uint32_t) 0x01U) {
        tmp = ERROR;
    } else {
        /* Do nothing */
    }
    return tmp;
}



/**
  * @brief  Fill the DMA setting data of specified channel of the specified DMAC unit to RAM.
  * @param  DMACx: Select DMAC unit.
  *          This parameter can be one of the following values:
  *            DMAC_UNIT_A :  DMAC unit A
  *            DMAC_UNIT_B :  DMAC unit B
  * @param  Channel: Select channel.
  *          This parameter can be one of the following values:
  *             DMAC_ADC0_END,
  *             DMAC_ADC1_END,
  *             DMAC_DAC0_TRG,
  *             DMAC_DAC1_TRG,
  *             DMAC_SSP0_RX,
  *             DMAC_SSP0_TX,
  *             DMAC_SSP1_RX,
  *             DMAC_SSP1_TX,
  *             DMAC_SSP2_RX,
  *             DMAC_SSP2_TX,
  *             DMAC_FUART4_RX,
  *             DMAC_FUART4_TX,
  *             DMAC_FUART5_RX,
  *             DMAC_FUART5_TX,
  *             DMAC_SIO0_RX,
  *             DMAC_SIO0_TX,
  *             DMAC_SIO1_RX,
  *             DMAC_SIO1_TX,
  *             DMAC_SIO2_RX,
  *             DMAC_SIO2_TX,
  *             DMAC_SIO3_RX,
  *             DMAC_SIO3_TX,
  *             DMAC_SBI0_RXTX,
  *             DMAC_SBI1_RXTX,
  *             DMAC_SBI2_RXTX,
  *             DMAC_TMRB0_CMP_MATCH,
  *             DMAC_TMRB1_CMP_MATCH,
  *             DMAC_TMRB2_CMP_MATCH,
  *             DMAC_TMRB3_CMP_MATCH,
  *             DMAC_TMRB4_CMP_MATCH,
  *             DMAC_PIN,
  *             DMAC_SW_TRG
  * @param  InitStruct: the structure contain the DMA setting values.
  * @retval None
  */
void DMAC_FillInitData(TSB_DMA_TypeDef * DMACx, DMAC_Channel Channel, DMAC_InitTypeDef * InitStruct)
{
    DMAC_PrimaryAlt PriAlt = DMAC_PRIMARY;
    uint32_t Addr = 0U;
    uint32_t tmpCtrl = 0U;

    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL_ALL(Channel));

    assert_param(IS_POINTER_NOT_NULL(InitStruct));

    assert_param(IS_DMAC_CYCLECTRL(InitStruct->Mode));
    assert_param(IS_DMAC_NEXT_USEBURST(InitStruct->NextUseBurst));
    assert_param(IS_DMAC_TXNUM(InitStruct->TxNum));
    assert_param(IS_DMAC_ARBITRATION(InitStruct->ArbitrationMoment));
    assert_param(IS_DMAC_BIT_WIDTH(InitStruct->SrcWidth));
    assert_param(IS_DMAC_INCWIDTH(InitStruct->SrcInc));
    assert_param(IS_DMAC_BIT_WIDTH(InitStruct->DstWidth));
    assert_param(IS_DMAC_INCWIDTH(InitStruct->DstInc));

    assert_param(IS_DMAC_INCWIDTH_VALID
                 ((uint32_t) InitStruct->SrcWidth, (uint32_t) InitStruct->SrcInc));
    assert_param(IS_DMAC_INCWIDTH_VALID
                 ((uint32_t) InitStruct->DstWidth, (uint32_t) InitStruct->DstInc));


    PriAlt = DMAC_GetPrimaryAlt(DMACx, Channel);

    if (PriAlt == DMAC_PRIMARY) {
        Addr = DMAC_GetBaseAddr(DMACx, DMAC_PRIMARY);
    } else {
        Addr = DMAC_GetBaseAddr(DMACx, DMAC_ALTERNATE);
    }

    /* add offset for channel, each channel use (4 x uint32_t) RAM */
    Addr += (16U * (uint32_t) Channel);

    /* make setting data for 'control data' */
    tmpCtrl |= (uint32_t) InitStruct->Mode;
    tmpCtrl |= (uint32_t) InitStruct->NextUseBurst << 3U;
    tmpCtrl |= (uint32_t) (InitStruct->TxNum - 1U) << 4U;
    tmpCtrl |= (uint32_t) InitStruct->ArbitrationMoment << 14U;
    tmpCtrl |= (uint32_t) InitStruct->SrcWidth << 24U;
    tmpCtrl |= (uint32_t) InitStruct->SrcInc << 26U;
    tmpCtrl |= (uint32_t) InitStruct->DstWidth << 28U;
    tmpCtrl |= (uint32_t) InitStruct->DstInc << 30U;

    /* write setting data to right address */
    *((uint32_t *) (Addr)) = InitStruct->SrcEndPointer;
    *((uint32_t *) (Addr + 4U)) = InitStruct->DstEndPointer;
    *((uint32_t *) (Addr + 8U)) = tmpCtrl;
    *((uint32_t *) (Addr + 12U)) = (uint32_t) 0U;

}



/** @} */
/* End of group uDMAC_Exported_Functions */

/** @} */
/* End of group uDMAC */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM369_uDMAC_H) */
